Repository: xcv58/MacTools
Catalog: Plugins/RightClick/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# metadata.title
source: 右键工具
ar: انقر بزر الماوس الأيمن
de: Rechtsklick
en: Right Click
es: Clic derecho
fr: Clic droit
ja: 右クリック
ko: 오른쪽 클릭
pt: Clique com o botão direito
ru: Щелкните правой кнопкой мыши
tr: Sağ Tıklama
zh_hant: 右鍵工具

# metadata.description
source: 在 Finder 右键菜单中快速新建文件夹和复制路径
ar: أضف إجراءات قائمة السياق Finder السريعة للمجلدات والمسارات.
de: Fügen Sie schnelle Finder-Kontextmenüaktionen für Ordner und Pfade hinzu.
en: Add quick Finder context menu actions for folders and paths.
es: Agregue acciones rápidas del menú contextual Finder para carpetas y rutas.
fr: Ajoutez des actions rapides de menu contextuel Finder pour les dossiers et les chemins.
ja: フォルダーとパスに対するクイック Finder コンテキスト メニュー アクションを追加します。
ko: 폴더 및 경로에 대한 빠른 Finder 컨텍스트 메뉴 작업을 추가합니다.
pt: Adicione ações rápidas do menu de contexto Finder para pastas e caminhos.
ru: Добавьте быстрые действия контекстного меню Finder для папок и путей.
tr: Klasörler ve yollar için hızlı Finder bağlam menüsü eylemleri ekler.
zh_hant: 在 Finder 右鍵菜單中快速新建資料夾和複製路徑

# permission.finderExtension.title
source: Finder 扩展
ar: Finder الامتداد
de: Finder Erweiterung
en: Finder Extension
es: Finder Extensión
fr: Finder Extension
ja: Finder 拡張機能
ko: Finder 확장
pt: Finder Extensão
ru: Finder Расширение
tr: Finder Uzantısı
zh_hant: Finder 擴展

# permission.finderExtension.description
source: 在系统设置中打开 MacTools 右键工具。
ar: قم بتشغيل MacTools انقر بزر الماوس الأيمن في إعدادات النظام.
de: Aktivieren Sie „MacTools“ mit der rechten Maustaste in den Systemeinstellungen.
en: Turn on MacTools Right Click in System Settings.
es: Activa MacTools Clic derecho en Configuración del sistema.
fr: Activez MacTools Clic droit dans les paramètres système.
ja: システム設定で MacTools を右クリックしてオンにします。
ko: 시스템 설정에서 MacTools을(를) 마우스 오른쪽 버튼으로 클릭하세요.
pt: Ative MacTools Clique com o botão direito nas configurações do sistema.
ru: Включите MacTools Щелкните правой кнопкой мыши в настройках системы.
tr: Sistem Ayarları'nda MacTools Sağ Tıklama'yı açın.
zh_hant: 在系統設定中打開 MacTools 右鍵工具。

# permission.finderExtension.status.disabled
source: 未启用
ar: معطل
de: Deaktiviert
en: Disabled
es: Desactivado
fr: Désactivé
ja: 無効
ko: 비활성화
pt: Desativado
ru: Отключено
tr: Devre dışı
zh_hant: 未啟用

# permission.finderExtension.status.enabled
source: 已启用
ar: ممكّن
de: Aktiviert
en: Enabled
es: Habilitado
fr: Activé
ja: 有効
ko: 활성화됨
pt: Ativado
ru: Включено
tr: Etkin
zh_hant: 已啟用

# permission.finderExtension.footnote
source: 入口：登录项与扩展 > Finder 扩展。
ar: المسار: عناصر وملحقات تسجيل الدخول > Finder الملحقات.
de: Pfad: Anmeldeelemente und Erweiterungen > Finder Erweiterungen.
en: Path: Login Items & Extensions > Finder Extensions.
es: Ruta: Elementos y extensiones de inicio de sesión > Finder Extensiones.
fr: Chemin : Éléments de connexion et extensions > Finder Extensions.
ja: パス: ログイン項目と拡張機能 > Finder 拡張機能。
ko: 경로: 로그인 항목 및 확장 > Finder 확장.
pt: Caminho: Itens de login e extensões > Finder Extensões.
ru: Путь: Элементы входа и расширения > Finder Расширения.
tr: Yol: Oturum Öğeleri ve Uzantılar > Finder Uzantıları.
zh_hant: 入口：登錄項與擴展 > Finder 擴展。

# configuration.description
source: 选择 Finder 右键菜单显示哪些项，并管理「用应用打开」的应用列表。
ar: اختر عناصر قائمة السياق Finder التي سيتم عرضها وقم بإدارة التطبيقات في "فتح باستخدام".
de: Wählen Sie aus, welche Finder-Kontextmenüelemente angezeigt werden, und verwalten Sie die Apps in „Öffnen mit“.
en: Choose which Finder context menu items are shown and manage the apps in Open With.
es: Elija qué Finder elementos del menú contextual se muestran y administre las aplicaciones en Abrir con.
fr: Choisissez les éléments du menu contextuel Finder à afficher et gérez les applications dans Ouvrir avec.
ja: 表示する Finder コンテキスト メニュー項目を選択し、「プログラムから開く」でアプリを管理します。
ko: 표시되는 Finder 컨텍스트 메뉴 항목을 선택하고 연결 프로그램에서 앱을 관리하세요.
pt: Escolha quais Finder itens do menu de contexto serão exibidos e gerencie os aplicativos em Abrir com.
ru: Выберите, какие Finder элементы контекстного меню будут отображаться, и управляйте приложениями с помощью функции «Открыть с помощью».
tr: Hangi Finder bağlam menüsü öğelerinin gösterileceğini seçin ve Birlikte Aç'taki uygulamaları yönetin.
zh_hant: 選擇 Finder 右鍵菜單顯示哪些項，並管理「用應用打開」的應用列表。

# settings.addApp.button
source: 添加
ar: إضافة
de: Hinzufügen
en: Add
es: Agregar
fr: Ajouter
ja: 追加
ko: 추가
pt: Adicionar
ru: Добавить
tr: Ekle

# settings.copy.title
source: 复制菜单项
ar: نسخ عناصر القائمة
de: Menüelemente kopieren
en: Copy Menu Items
es: Copiar elementos del menú
fr: Copier les éléments du menu
ja: メニュー項目をコピー
ko: 메뉴 항목 복사
pt: Copiar itens do menu
ru: Копировать пункты меню
tr: Kopyalama Menü Öğeleri
zh_hant: 複製菜單項

# settings.copyAbsolutePath.title
source: 复制绝对路径
ar: نسخ المسار المطلق
de: Absoluten Pfad kopieren
en: Copy Absolute Path
es: Copiar ruta absoluta
fr: Copier le chemin absolu
ja: 絶対パスをコピー
ko: 절대 경로 복사
pt: Copiar caminho absoluto
ru: Копировать абсолютный путь
tr: Mutlak Yolu Kopyala
zh_hant: 複製絕對路徑

# settings.copyFileName.title
source: 复制文件名
ar: نسخ اسم الملف
de: Dateinamen kopieren
en: Copy File Name
es: Copiar nombre de archivo
fr: Copier le nom du fichier
ja: ファイル名をコピー
ko: 파일 이름 복사
pt: Copiar nome do arquivo
ru: Копировать имя файла
tr: Dosya Adını Kopyala
zh_hant: 複製檔案名

# settings.copyFileURL.title
source: 复制 file:// 链接
ar: انسخ رابط file://
de: Link file:// kopieren
en: Copy file:// Link
es: Copiar enlace file://
fr: Copier le lien file://
ja: file:// リンクをコピー
ko: file:// 링크 복사
pt: Copiar link file://
ru: Копировать ссылку file://
tr: file:// Bağlantısını Kopyala
zh_hant: 複製 file:// 鏈接

# settings.copyRelativePath.title
source: 复制相对路径
ar: نسخ المسار النسبي
de: Relativen Pfad kopieren
en: Copy Relative Path
es: Copiar ruta relativa
fr: Copier le chemin relatif
ja: 相対パスをコピー
ko: 상대 경로 복사
pt: Copiar caminho relativo
ru: Копировать относительный путь
tr: Göreceli Yolu Kopyala
zh_hant: 複製相對路徑

# settings.copyShellEscapedPath.description
source: 适合终端命令
ar: للأوامر الطرفية
de: Für Terminalbefehle
en: For terminal commands
es: Para comandos de terminal
fr: Pour les commandes de terminal
ja: 端末コマンドの場合
ko: 터미널 명령의 경우
pt: Para comandos de terminal
ru: Для команд терминала
tr: Terminal komutları için
zh_hant: 適合終端命令

# settings.copyShellEscapedPath.title
source: 复制转义路径
ar: نسخ المسار الذي تم الهروب منه
de: Escaped Path kopieren
en: Copy Escaped Path
es: Copiar ruta de escape
fr: Copier le chemin échappé
ja: エスケープパスをコピー
ko: 이스케이프된 경로 복사
pt: Copiar caminho de escape
ru: Копировать экранированный путь
tr: Kaçışlı Yolu Kopyala
zh_hant: 複製轉義路徑

# settings.deleteApp.help
source: 删除应用
ar: حذف التطبيق
de: App löschen
en: Delete app
es: Eliminar aplicación
fr: Supprimer l'application
ja: アプリを削除
ko: 앱 삭제
pt: Excluir aplicativo
ru: Удалить приложение
tr: Uygulamayı sil
zh_hant: 刪除應用

# settings.directory.title
source: 目录操作
ar: إجراءات الدليل
de: Verzeichnisaktionen
en: Directory Actions
es: Acciones de directorio
fr: Actions de répertoire
ja: ディレクトリアクション
ko: 디렉터리 작업
pt: Ações de diretório
ru: Действия с каталогом
tr: Klasör Eylemleri
zh_hant: 目錄操作

# settings.extensions.placeholder
source: 扩展名
ar: الامتدادات
de: Erweiterungen
en: Extensions
es: Extensiones
fr: Extensions
ja: 拡張機能
ko: 확장
pt: Extensões
ru: Расширения
tr: Uzantılar
zh_hant: 擴展名

# settings.newFile.description
source: 支持 .txt、.md、.json、.html 等常见扩展名
ar: امتدادات شائعة تشمل .txt و.md و.json و.html
de: Gängige Erweiterungen wie .txt, .md, .json und .html
en: Common extensions including .txt, .md, .json, and .html
es: Extensiones comunes como .txt, .md, .json y .html
fr: Extensions courantes comme .txt, .md, .json et .html
ja: .txt、.md、.json、.html などの一般的な拡張子
ko: .txt, .md, .json, .html 등 일반적인 확장자
pt: Extensões comuns como .txt, .md, .json e .html
ru: Распространённые расширения: .txt, .md, .json и .html
tr: .txt, .md, .json ve .html gibi yaygın uzantılar
zh_hant: 支援 .txt、.md、.json、.html 等常見副檔名

# settings.newFile.title
source: 新建文件
ar: ملف جديد
de: Neue Datei
en: New File
es: Nuevo archivo
fr: Nouveau fichier
ja: 新しいファイル
ko: 새 파일
pt: Novo arquivo
ru: Новый файл
tr: Yeni Dosya
zh_hant: 新建檔案

# settings.newFolder.title
source: 新建文件夹
ar: مجلد جديد
de: Neuer Ordner
en: New Folder
es: Nueva carpeta
fr: Nouveau dossier
ja: 新しいフォルダー
ko: 새 폴더
pt: Nova pasta
ru: Новая папка
tr: Yeni Klasör
zh_hant: 新建資料夾

# settings.openPanel.prompt
source: 选择
ar: اختر
de: Auswählen
en: Choose
es: Elegir
fr: Choisir
ja: 選択
ko: 선택
pt: Escolher
ru: Выбрать
tr: Seç
zh_hant: 選擇

# settings.openTerminal.title
source: 在终端打开
ar: فتح في الوحدة الطرفية
de: Im Terminal öffnen
en: Open in Terminal
es: Abrir en la terminal
fr: Ouvrir dans le terminal
ja: ターミナルで開く
ko: 터미널에서 열기
pt: Abrir no Terminal
ru: Открыть в терминале
tr: Terminal'de Aç
zh_hant: 在終端打開

# settings.openWith.empty
source: 暂无应用
ar: لا توجد تطبيقات
de: Keine Apps
en: No apps
es: Sin aplicaciones
fr: Aucune application
ja: アプリがありません
ko: 앱 없음
pt: Sem aplicativos
ru: Нет приложений
tr: Uygulama yok
zh_hant: 暫無應用

# settings.openWith.footnote
source: 扩展名留空表示对所有文件显示，多个扩展名用逗号分隔。
ar: اترك الامتدادات فارغة لتظهر لجميع الملفات. افصل بين الإضافات المتعددة بفواصل.
de: Lassen Sie die Erweiterungen leer, damit sie für alle Dateien angezeigt werden. Trennen Sie mehrere Erweiterungen durch Kommas.
en: Leave extensions empty to show for all files. Separate multiple extensions with commas.
es: Deje las extensiones vacías para mostrarlas en todos los archivos. Separe varias extensiones con comas.
fr: Laissez les extensions vides pour les afficher pour tous les fichiers. Séparez plusieurs extensions par des virgules.
ja: すべてのファイルに対して表示するには、拡張子を空のままにします。複数の拡張子はカンマで区切ります。
ko: 모든 파일에 대해 표시하려면 확장자를 비워 두세요. 확장자가 여러 개인 경우 쉼표로 구분하세요.
pt: Deixe as extensões vazias para serem exibidas em todos os arquivos. Separe várias extensões com vírgulas.
ru: Оставьте расширения пустыми, чтобы они отображались для всех файлов. Разделяйте несколько расширений запятыми.
tr: Tüm dosyalar için gösterilmesini istiyorsanız uzantıları boş bırakın. Birden fazla uzantıyı virgülle ayırın.
zh_hant: 擴展名留空表示對所有檔案顯示，多個擴展名用逗號分隔。

# settings.openWith.title
source: 用应用打开
ar: فتح باستخدام
de: Öffnen mit
en: Open With
es: Abrir con
fr: Ouvrir avec
ja: 次で開く
ko: 다음으로 열기
pt: Abrir com
ru: Открыть с помощью
tr: Birlikte Aç
zh_hant: 用應用打開
